In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [4]:
df = sns.load_dataset('titanic')

In [5]:
df.isna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [54]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [55]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [56]:
df.loc[df.embark_town.isna(),:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [57]:
df.deck.value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [58]:
df.deck.value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [59]:
df.deck.isna()
# 누락 데이터

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: deck, Length: 891, dtype: bool

In [60]:
~df.deck.isna()
# 누락 안된 데이터

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: deck, Length: 891, dtype: bool

In [61]:
df.isna().sum().sort_values()[::-1]

deck           688
age            177
embark_town      2
embarked         2
alone            0
alive            0
adult_male       0
who              0
class            0
fare             0
parch            0
sibsp            0
sex              0
pclass           0
survived         0
dtype: int64

In [62]:
np.around(df.isna().sum().sort_values()[::-1]/df.shape[0],2)

deck           0.77
age            0.20
embark_town    0.00
embarked       0.00
alone          0.00
alive          0.00
adult_male     0.00
who            0.00
class          0.00
fare           0.00
parch          0.00
sibsp          0.00
sex            0.00
pclass         0.00
survived       0.00
dtype: float64

In [63]:
raw_df = df.copy()
# 원본 다날리는거 방지용

In [64]:
raw_df.shape

(891, 15)

In [65]:
# row 지운다
df = df.loc[~df.deck.isna(),:]

In [66]:
df.shape

(203, 15)

In [67]:
df.isna().sum().sort_values()[::-1]

age            19
embark_town     2
embarked        2
alone           0
alive           0
deck            0
adult_male      0
who             0
class           0
fare            0
parch           0
sibsp           0
sex             0
pclass          0
survived        0
dtype: int64

In [68]:
df.shape[0]/raw_df.shape[0]

0.22783389450056116

In [69]:
# 72퍼였는데 지우고나니까 22퍼

In [70]:
df = raw_df

In [71]:
df.shape

(891, 15)

In [72]:
df.drop(columns=['deck']).isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
embark_town      2
alive            0
alone            0
dtype: int64

In [73]:
df.drop(columns=['deck'],inplace=True)

In [74]:
df.shape
# 열이 하나 사라진 모습

(891, 14)

In [75]:
# 891과 714는 안맞다

In [76]:
df.age.size

891

In [77]:
df.age.dropna().size

714

In [78]:
df.loc[df.embarked.isna()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,NaN,yes,True

In [79]:
df = df.loc[~df.embarked.isna()]

In [80]:
# index를 찾아서 drop으로 지우든가 loc 저렇게 지워도되고

In [81]:
df.shape

(889, 14)

In [82]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

In [83]:
# age만 남았다 => 지우기 불가능?

In [84]:
df = pd.DataFrame()

In [85]:
df['c1'] = ['a','a','b','a','b']
df['c2'] = [1,1,1,2,2]
df['c3'] = [1,1,2,2,2]

In [86]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [87]:
# duplicated

In [88]:
df[df.duplicated()]

  c1  c2  c3
1  a   1   1

In [89]:
df[~df.duplicated()]

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [90]:
df.loc[5] = ['a',1,1]

In [91]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
5  a   1   1

In [92]:
df.duplicated(keep='last')

0     True
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [93]:
~df.duplicated(keep='last')

0    False
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [94]:
df.iloc[0,:]

c1    a
c2    1
c3    1
Name: 0, dtype: object

In [95]:
df.shape[1]

3

In [96]:
sum(df.iloc[0,:] == df.iloc[1,:]) == df.shape[1]
sum(df.iloc[0,:] == df.iloc[2,:]) == df.shape[1]
sum(df.iloc[0,:] == df.iloc[3,:]) == df.shape[1]
sum(df.iloc[0,:] == df.iloc[4,:]) == df.shape[1]
sum(df.iloc[0,:] == df.iloc[5,:]) == df.shape[1]
sum(df.iloc[1,:] == df.iloc[2,:]) == df.shape[1]
sum(df.iloc[1,:] == df.iloc[3,:]) == df.shape[1]
sum(df.iloc[1,:] == df.iloc[4,:]) == df.shape[1]
sum(df.iloc[1,:] == df.iloc[5,:]) == df.shape[1]
sum(df.iloc[2,:] == df.iloc[3,:]) == df.shape[1]
sum(df.iloc[2,:] == df.iloc[4,:]) == df.shape[1]
sum(df.iloc[2,:] == df.iloc[5,:]) == df.shape[1]
sum(df.iloc[3,:] == df.iloc[4,:]) == df.shape[1]
sum(df.iloc[3,:] == df.iloc[5,:]) == df.shape[1]
sum(df.iloc[4,:] == df.iloc[5,:]) == df.shape[1]

# 이런 논리로 돌아간다

False

In [97]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
5  a   1   1

In [98]:
keep = 'first'
dup = []
for i in range(df.shape[0]-1):
    for j in range(df.shape[0]-i-1):
        if sum(df.iloc[i,:] == df.iloc[j+i+1,:]) == df.shape[1]:
            first = i
            last = j+i+1
            if keep == 'first':
                dup.append(last)
            else:
                dup.append(first)

dup = np.unique(dup)
result = np.full(df.shape[0],False)
result[dup] = True
df.loc[~result,:]

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [99]:
# 중복된 항목 지우기 완료

In [100]:
def my_duplicate(df,keep='first'):
    keep = 'first'
    dup = []
    for i in range(df.shape[0]-1):
        for j in range(df.shape[0]-i-1):
            if sum(df.iloc[i,:] == df.iloc[j+i+1,:]) == df.shape[1]:
                first = i
                last = j+i+1
                if keep == 'first':
                    dup.append(last)
                else:
                    dup.append(first)

    dup = np.unique(dup)
    result = np.full(df.shape[0],False)
    result[dup] = True
    return result

In [101]:
# 함수로 만들어 봤어요

In [102]:
my_duplicate(df)

array([False,  True, False, False, False,  True])

In [103]:
df.loc[~my_duplicate(df),:]

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [104]:
df.loc[~my_duplicate(df,keep='last'),:]

# 왜 마지막행만 남기지않는가

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [105]:
import sklearn

In [106]:
from sklearn.preprocessing import StandardScaler
from sklearn import datasets

In [107]:
data = datasets.load_iris()

In [108]:
data.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [109]:
df = pd.DataFrame(data['data'],columns=data['feature_names'])

In [110]:
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [111]:
sc = StandardScaler()
sc.fit(df)

StandardScaler()

In [112]:
sc.transform(df).shape

(150, 4)

In [113]:
df.shape

(150, 4)

In [114]:
np.max(df.values) - np.min(df.values)

7.800000000000001

In [115]:
np.max(sc.transform(df)) - np.min(sc.transform(df))

5.524722390207515

In [116]:
# 이렇게는 안하는게 좋다
# sc.fit_trasform(df)
# fit, transform은 따로 쓰자!

In [117]:
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [118]:
df.iloc[:,0]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal length (cm), Length: 150, dtype: float64

In [119]:
df.iloc[:,0].std()

0.8280661279778629

In [120]:
(df.iloc[:,0] - df.iloc[:,0].mean())  / df.iloc[:,0].std()

0     -0.897674
1     -1.139200
2     -1.380727
3     -1.501490
4     -1.018437
         ...
145    1.034539
146    0.551486
147    0.793012
148    0.430722
149    0.068433
Name: sepal length (cm), Length: 150, dtype: float64

In [121]:
def standard_scaler(df):
    result = np.zeros_like(df)
    for i in range(df.columns.size):
        result[:,i] = (df.iloc[:,i] - df.iloc[:,i].mean() ) / df.iloc[:,i].std()
        return result[:,i]

In [122]:
standard_scaler(df)

array([-0.89767388, -1.13920048, -1.38072709, -1.50149039, -1.01843718,
       -0.53538397, -1.50149039, -1.01843718, -1.74301699, -1.13920048,
       -0.53538397, -1.25996379, -1.25996379, -1.8637803 , -0.05233076,
       -0.17309407, -0.53538397, -0.89767388, -0.17309407, -0.89767388,
       -0.53538397, -0.89767388, -1.50149039, -0.89767388, -1.25996379,
       -1.01843718, -1.01843718, -0.77691058, -0.77691058, -1.38072709,
       -1.25996379, -0.53538397, -0.77691058, -0.41462067, -1.13920048,
       -1.01843718, -0.41462067, -1.13920048, -1.74301699, -0.89767388,
       -1.01843718, -1.62225369, -1.74301699, -1.01843718, -0.89767388,
       -1.25996379, -0.89767388, -1.50149039, -0.65614727, -1.01843718,
        1.39682886,  0.67224905,  1.27606556, -0.41462067,  0.79301235,
       -0.17309407,  0.55148575, -1.13920048,  0.91377565, -0.77691058,
       -1.01843718,  0.06843254,  0.18919584,  0.30995914, -0.29385737,
        1.03453895, -0.29385737, -0.05233076,  0.43072244, -0.29385737,
        0.06843254,  0.30995914,  0.55148575,  0.30995914,  0.67224905,
        0.91377565,  1.15530226,  1.03453895,  0.18919584, -0.17309407,
       -0.41462067, -0.41462067, -0.05233076,  0.18919584, -0.53538397,
        0.18919584,  1.03453895,  0.55148575, -0.29385737, -0.41462067,
       -0.41462067,  0.30995914, -0.05233076, -1.01843718, -0.29385737,
       -0.17309407, -0.17309407,  0.43072244, -0.89767388, -0.17309407,
        0.55148575, -0.05233076,  1.51759216,  0.55148575,  0.79301235,
        2.12140867, -1.13920048,  1.75911877,  1.03453895,  1.63835547,
        0.79301235,  0.67224905,  1.15530226, -0.17309407, -0.05233076,
        0.67224905,  0.79301235,  2.24217198,  2.24217198,  0.18919584,
        1.27606556, -0.29385737,  2.24217198,  0.55148575,  1.03453895,
        1.63835547,  0.43072244,  0.30995914,  0.67224905,  1.63835547,
        1.87988207,  2.48369858,  0.67224905,  0.55148575,  0.30995914,
        2.24217198,  0.55148575,  0.67224905,  0.18919584,  1.27606556,
        1.03453895,  1.27606556, -0.05233076,  1.15530226,  1.03453895,
        1.03453895,  0.55148575,  0.79301235,  0.43072244,  0.06843254])

In [123]:
standard_scaler(df).shape

(150,)

In [124]:
def minmax_scaler(df):
    result = np.zeros_like(df)
    for i in range(df.columns.size):
        result[:,i] = ( df.iloc[:,i] - df.iloc[:,i].min() ) / (df.iloc[:,i].max() - df.iloc[:,i].min())
    return result

In [125]:
minmax_scaler(df)

array([[0.22222222, 0.625     , 0.06779661, 0.04166667],
       [0.16666667, 0.41666667, 0.06779661, 0.04166667],
       [0.11111111, 0.5       , 0.05084746, 0.04166667],
       [0.08333333, 0.45833333, 0.08474576, 0.04166667],
       [0.19444444, 0.66666667, 0.06779661, 0.04166667],
       [0.30555556, 0.79166667, 0.11864407, 0.125     ],
       [0.08333333, 0.58333333, 0.06779661, 0.08333333],
       [0.19444444, 0.58333333, 0.08474576, 0.04166667],
       [0.02777778, 0.375     , 0.06779661, 0.04166667],
       [0.16666667, 0.45833333, 0.08474576, 0.        ],
       [0.30555556, 0.70833333, 0.08474576, 0.04166667],
       [0.13888889, 0.58333333, 0.10169492, 0.04166667],
       [0.13888889, 0.41666667, 0.06779661, 0.        ],
       [0.        , 0.41666667, 0.01694915, 0.        ],
       [0.41666667, 0.83333333, 0.03389831, 0.04166667],
       [0.38888889, 1.        , 0.08474576, 0.125     ],
       [0.30555556, 0.79166667, 0.05084746, 0.125     ],
       [0.22222222, 0.625     , 0.06779661, 0.08333333],
       [0.38888889, 0.75      , 0.11864407, 0.08333333],
       [0.22222222, 0.75      , 0.08474576, 0.08333333],
       [0.30555556, 0.58333333, 0.11864407, 0.04166667],
       [0.22222222, 0.70833333, 0.08474576, 0.125     ],
       [0.08333333, 0.66666667, 0.        , 0.04166667],
       [0.22222222, 0.54166667, 0.11864407, 0.16666667],
       [0.13888889, 0.58333333, 0.15254237, 0.04166667],
       [0.19444444, 0.41666667, 0.10169492, 0.04166667],
       [0.19444444, 0.58333333, 0.10169492, 0.125     ],
       [0.25      , 0.625     , 0.08474576, 0.04166667],
       [0.25      , 0.58333333, 0.06779661, 0.04166667],
       [0.11111111, 0.5       , 0.10169492, 0.04166667],
       [0.13888889, 0.45833333, 0.10169492, 0.04166667],
       [0.30555556, 0.58333333, 0.08474576, 0.125     ],
       [0.25      , 0.875     , 0.08474576, 0.        ],
       [0.33333333, 0.91666667, 0.06779661, 0.04166667],
       [0.16666667, 0.45833333, 0.08474576, 0.04166667],
       [0.19444444, 0.5       , 0.03389831, 0.04166667],
       [0.33333333, 0.625     , 0.05084746, 0.04166667],
       [0.16666667, 0.66666667, 0.06779661, 0.        ],
       [0.02777778, 0.41666667, 0.05084746, 0.04166667],
       [0.22222222, 0.58333333, 0.08474576, 0.04166667],
       [0.19444444, 0.625     , 0.05084746, 0.08333333],
       [0.05555556, 0.125     , 0.05084746, 0.08333333],
       [0.02777778, 0.5       , 0.05084746, 0.04166667],
       [0.19444444, 0.625     , 0.10169492, 0.20833333],
       [0.22222222, 0.75      , 0.15254237, 0.125     ],
       [0.13888889, 0.41666667, 0.06779661, 0.08333333],
       [0.22222222, 0.75      , 0.10169492, 0.04166667],
       [0.08333333, 0.5       , 0.06779661, 0.04166667],
       [0.27777778, 0.70833333, 0.08474576, 0.04166667],
       [0.19444444, 0.54166667, 0.06779661, 0.04166667],
       [0.75      , 0.5       , 0.62711864, 0.54166667],
       [0.58333333, 0.5       , 0.59322034, 0.58333333],
       [0.72222222, 0.45833333, 0.66101695, 0.58333333],
       [0.33333333, 0.125     , 0.50847458, 0.5       ],
       [0.61111111, 0.33333333, 0.61016949, 0.58333333],
       [0.38888889, 0.33333333, 0.59322034, 0.5       ],
       [0.55555556, 0.54166667, 0.62711864, 0.625     ],
       [0.16666667, 0.16666667, 0.38983051, 0.375     ],
       [0.63888889, 0.375     , 0.61016949, 0.5       ],
       [0.25      , 0.29166667, 0.49152542, 0.54166667],
       [0.19444444, 0.        , 0.42372881, 0.375     ],
       [0.44444444, 0.41666667, 0.54237288, 0.58333333],
       [0.47222222, 0.08333333, 0.50847458, 0.375     ],
       [0.5       , 0.375     , 0.62711864, 0.54166667],
       [0.36111111, 0.375     , 0.44067797, 0.5       ],
       [0.66666667, 0.45833333, 0.57627119, 0.54166667],
       [0.36111111, 0.41666667, 0.59322034, 0.58333333],
       [0.41666667, 0.29166667, 0.52542373, 0.375     ],
       [0.52777778, 0.08333333, 0.59322034, 0.58333333],
       [0.36111111, 0.20833333, 0.49152542, 0.41666667],
       [0.44444444, 0.5       , 0.6440678 , 0.70833333],
       [0.5       , 0.33333333, 0.50847458, 0.5       ],
       [0.55555556, 0.20833333, 0.66101695, 0.58333333],
       [0.5       , 0.33333333, 0.62711864, 0.45833333],
       [0.58333333, 0.375     , 0.55932203, 0.5       ],
       [0.63888889, 0.41666667, 0.57627119, 0.54166667],
       [0.69444444, 0.33333333, 0.6440678 , 0.54166667],
       [0.66666667, 0.41666667, 0.6779661 , 0.66666667],
       [0.47222222, 0.375     , 0.59322034, 0.58333333],
       [0.38888889, 0.25      , 0.42372881, 0.375     ],
       [0.33333333, 0.16666667, 0.47457627, 0.41666667],
       [0.33333333, 0.16666667, 0.45762712, 0.375     ],
       [0.41666667, 0.29166667, 0.49152542, 0.45833333],
       [0.47222222, 0.29166667, 0.69491525, 0.625     ],
       [0.30555556, 0.41666667, 0.59322034, 0.58333333],
       [0.47222222, 0.58333333, 0.59322034, 0.625     ],
       [0.66666667, 0.45833333, 0.62711864, 0.58333333],
       [0.55555556, 0.125     , 0.57627119, 0.5       ],
       [0.36111111, 0.41666667, 0.52542373, 0.5       ],
       [0.33333333, 0.20833333, 0.50847458, 0.5       ],
       [0.33333333, 0.25      , 0.57627119, 0.45833333],
       [0.5       , 0.41666667, 0.61016949, 0.54166667],
       [0.41666667, 0.25      , 0.50847458, 0.45833333],
       [0.19444444, 0.125     , 0.38983051, 0.375     ],
       [0.36111111, 0.29166667, 0.54237288, 0.5       ],
       [0.38888889, 0.41666667, 0.54237288, 0.45833333],
       [0.38888889, 0.375     , 0.54237288, 0.5       ],
       [0.52777778, 0.375     , 0.55932203, 0.5       ],
       [0.22222222, 0.20833333, 0.33898305, 0.41666667],
       [0.38888889, 0.33333333, 0.52542373, 0.5       ],
       [0.55555556, 0.54166667, 0.84745763, 1.        ],
       [0.41666667, 0.29166667, 0.69491525, 0.75      ],
       [0.77777778, 0.41666667, 0.83050847, 0.83333333],
       [0.55555556, 0.375     , 0.77966102, 0.70833333],
       [0.61111111, 0.41666667, 0.81355932, 0.875     ],
       [0.91666667, 0.41666667, 0.94915254, 0.83333333],
       [0.16666667, 0.20833333, 0.59322034, 0.66666667],
       [0.83333333, 0.375     , 0.89830508, 0.70833333],
       [0.66666667, 0.20833333, 0.81355932, 0.70833333],
       [0.80555556, 0.66666667, 0.86440678, 1.        ],
       [0.61111111, 0.5       , 0.69491525, 0.79166667],
       [0.58333333, 0.29166667, 0.72881356, 0.75      ],
       [0.69444444, 0.41666667, 0.76271186, 0.83333333],
       [0.38888889, 0.20833333, 0.6779661 , 0.79166667],
       [0.41666667, 0.33333333, 0.69491525, 0.95833333],
       [0.58333333, 0.5       , 0.72881356, 0.91666667],
       [0.61111111, 0.41666667, 0.76271186, 0.70833333],
       [0.94444444, 0.75      , 0.96610169, 0.875     ],
       [0.94444444, 0.25      , 1.        , 0.91666667],
       [0.47222222, 0.08333333, 0.6779661 , 0.58333333],
       [0.72222222, 0.5       , 0.79661017, 0.91666667],
       [0.36111111, 0.33333333, 0.66101695, 0.79166667],
       [0.94444444, 0.33333333, 0.96610169, 0.79166667],
       [0.55555556, 0.29166667, 0.66101695, 0.70833333],
       [0.66666667, 0.54166667, 0.79661017, 0.83333333],
       [0.80555556, 0.5       , 0.84745763, 0.70833333],
       [0.52777778, 0.33333333, 0.6440678 , 0.70833333],
       [0.5       , 0.41666667, 0.66101695, 0.70833333],
       [0.58333333, 0.33333333, 0.77966102, 0.83333333],
       [0.80555556, 0.41666667, 0.81355932, 0.625     ],
       [0.86111111, 0.33333333, 0.86440678, 0.75      ],
       [1.        , 0.75      , 0.91525424, 0.79166667],
       [0.58333333, 0.33333333, 0.77966102, 0.875     ],
       [0.55555556, 0.33333333, 0.69491525, 0.58333333],
       [0.5       , 0.25      , 0.77966102, 0.54166667],
       [0.94444444, 0.41666667, 0.86440678, 0.91666667],
       [0.55555556, 0.58333333, 0.77966102, 0.95833333],
       [0.58333333, 0.45833333, 0.76271186, 0.70833333],
       [0.47222222, 0.41666667, 0.6440678 , 0.70833333],
       [0.72222222, 0.45833333, 0.74576271, 0.83333333],
       [0.66666667, 0.45833333, 0.77966102, 0.95833333],
       [0.72222222, 0.45833333, 0.69491525, 0.91666667],
       [0.41666667, 0.29166667, 0.69491525, 0.75      ],
       [0.69444444, 0.5       , 0.83050847, 0.91666667],
       [0.66666667, 0.54166667, 0.79661017, 1.        ],
       [0.66666667, 0.41666667, 0.71186441, 0.91666667],
       [0.55555556, 0.20833333, 0.6779661 , 0.75      ],
       [0.61111111, 0.41666667, 0.71186441, 0.79166667],
       [0.52777778, 0.58333333, 0.74576271, 0.91666667],
       [0.44444444, 0.41666667, 0.69491525, 0.70833333]])

In [126]:
# MinMaxScaler : 자기자신 - min / max - min

In [127]:
titanic = sns.load_dataset('titanic')

In [128]:
titanic.age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [129]:
age = titanic.age.fillna(titanic.age.mean())

In [130]:
age

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [131]:
pd.cut(age,5)

0      (16.336, 32.252]
1      (32.252, 48.168]
2      (16.336, 32.252]
3      (32.252, 48.168]
4      (32.252, 48.168]
             ...
886    (16.336, 32.252]
887    (16.336, 32.252]
888    (16.336, 32.252]
889    (16.336, 32.252]
890    (16.336, 32.252]
Name: age, Length: 891, dtype: category
Categories (5, interval[float64, right]): [(0.34, 16.336] < (16.336, 32.252] < (32.252, 48.168] < (48.168, 64.084] < (64.084, 80.0]]

In [132]:
pd.cut(age,5).dtype

CategoricalDtype(categories=[(0.34, 16.336], (16.336, 32.252], (32.252, 48.168], (48.168, 64.084], (64.084, 80.0]], ordered=True)

In [133]:
np.linspace(1,10,5)

#구간 5개로 나눠주는 메서드

array([ 1.  ,  3.25,  5.5 ,  7.75, 10.  ])

In [134]:
np.linspace(age.min(),age.max(),6)

# cut 이외에도 linsapce를 애용할것

array([ 0.42 , 16.336, 32.252, 48.168, 64.084, 80.   ])

In [135]:
day = np.datetime64('2022-01-01') + np.arange(365)

In [136]:
sales = np.random.randint(60,100,day.size)

In [137]:
location = np.random.choice(['서울','부산','세종'],day.size)

In [138]:
sales_report = pd.DataFrame()
sales_report['day'] = day
sales_report['location'] = location
sales_report['sales'] = sales

In [139]:
sales_report.head()

         day location  sales
0 2022-01-01       서울     65
1 2022-01-02       부산     84
2 2022-01-03       부산     68
3 2022-01-04       서울     87
4 2022-01-05       세종     89

In [140]:
# 그룹으로 묶어보자

In [141]:
sales_report.dtypes

day         datetime64[ns]
location            object
sales                int32
dtype: object

In [142]:
day_str = sales_report.day.astype('str')

In [143]:
sales_report['day_str'] = day_str

In [144]:
sales_report.loc[sales_report.day_str.str.slice(5,7) == '01']

          day location  sales     day_str
0  2022-01-01       서울     65  2022-01-01
1  2022-01-02       부산     84  2022-01-02
2  2022-01-03       부산     68  2022-01-03
3  2022-01-04       서울     87  2022-01-04
4  2022-01-05       세종     89  2022-01-05
5  2022-01-06       부산     92  2022-01-06
6  2022-01-07       세종     85  2022-01-07
7  2022-01-08       세종     64  2022-01-08
8  2022-01-09       서울     87  2022-01-09
9  2022-01-10       서울     73  2022-01-10
10 2022-01-11       서울     70  2022-01-11
11 2022-01-12       서울     79  2022-01-12
12 2022-01-13       부산     89  2022-01-13
13 2022-01-14       부산     80  2022-01-14
14 2022-01-15       세종     90  2022-01-15
15 2022-01-16       부산     79  2022-01-16
16 2022-01-17       서울     69  2022-01-17
17 2022-01-18       서울     61  2022-01-18
18 2022-01-19       서울     69  2022-01-19
19 2022-01-20       세종     87  2022-01-20
20 2022-01-21       부산     69  2022-01-21
21 2022-01-22       부산     91  2022-01-22
22 2022-01-23       세종     73  2022-01-23
23 2022-01-24       서울     93  2022-01-24
24 2022-01-25       세종     92  2022-01-25
25 2022-01-26       서울     79  2022-01-26
26 2022-01-27       세종     84  2022-01-27
27 2022-01-28       부산     68  2022-01-28
28 2022-01-29       세종     93  2022-01-29
29 2022-01-30       부산     98  2022-01-30
30 2022-01-31       서울     71  2022-01-31

In [145]:
sales_report.value_counts(['day_str','location'])

day_str     location
2022-01-01  서울          1
2022-09-09  세종          1
2022-09-07  서울          1
2022-09-06  세종          1
2022-09-05  세종          1
                       ..
2022-05-01  부산          1
2022-04-30  서울          1
2022-04-29  서울          1
2022-04-28  서울          1
2022-12-31  부산          1
Length: 365, dtype: int64

In [146]:
sales_report.groupby(['day_str','location']).sum().reset_index()

        day_str location  sales
0    2022-01-01       서울     65
1    2022-01-02       부산     84
2    2022-01-03       부산     68
3    2022-01-04       서울     87
4    2022-01-05       세종     89
..          ...      ...    ...
360  2022-12-27       서울     76
361  2022-12-28       세종     88
362  2022-12-29       세종     89
363  2022-12-30       세종     82
364  2022-12-31       부산     81

[365 rows x 3 columns]

In [147]:
month = sales_report.day_str.str.slice(5,7)

In [148]:
sales_report['month'] = month

In [149]:
sales_report

           day location  sales     day_str month
0   2022-01-01       서울     65  2022-01-01    01
1   2022-01-02       부산     84  2022-01-02    01
2   2022-01-03       부산     68  2022-01-03    01
3   2022-01-04       서울     87  2022-01-04    01
4   2022-01-05       세종     89  2022-01-05    01
..         ...      ...    ...         ...   ...
360 2022-12-27       서울     76  2022-12-27    12
361 2022-12-28       세종     88  2022-12-28    12
362 2022-12-29       세종     89  2022-12-29    12
363 2022-12-30       세종     82  2022-12-30    12
364 2022-12-31       부산     81  2022-12-31    12

[365 rows x 5 columns]

In [150]:
sales_total = sales_report.groupby(['month','location']).sum().reset_index()

In [151]:
sales_total.head()

  month location  sales
0    01       부산    818
1    01       서울    903
2    01       세종    757
3    02       부산    662
4    02       서울    889

In [152]:
sales_pivot = sales_total.pivot(index=['location'],columns=['month'],values=['sales'])

In [153]:
sales_pivot

         sales
month       01   02    03    04    05   06   07    08    09    10   11    12
location
부산         818  662   954   451   702  824  687  1121   657   659  734  1001
서울         903  889   399   860  1038  995  770   332   699  1193  992   663
세종         757  735  1085  1137   663  662  992  1057  1107   660  731   727

In [154]:
sales_pivot.columns = ['month_' + j for _,j in sales_pivot.columns]

In [155]:
sales_pivot

,month_01,month_02,month_03,month_04,month_05,month_06,month_07,month_08,month_09,month_10,month_11,month_12
location,,,,,,,,,,,,
부산,818,662,954,451,702,824,687,1121,657,659,734,1001
서울,903,889,399,860,1038,995,770,332,699,1193,992,663
세종,757,735,1085,1137,663,662,992,1057,1107,660,731,727

In [156]:
sales_pivot.iloc[1,1]=np.nan
sales_pivot.iloc[2,3] = np.nan

In [157]:
sales_pivot

,month_01,month_02,month_03,month_04,month_05,month_06,month_07,month_08,month_09,month_10,month_11,month_12
location,,,,,,,,,,,,
부산,818,662.0,954,451.0,702,824,687,1121,657,659,734,1001
서울,903,NaN,399,860.0,1038,995,770,332,699,1193,992,663
세종,757,735.0,1085,NaN,663,662,992,1057,1107,660,731,727

In [158]:
sales_pivot.fillna(method='ffill')

,month_01,month_02,month_03,month_04,month_05,month_06,month_07,month_08,month_09,month_10,month_11,month_12
location,,,,,,,,,,,,
부산,818,662.0,954,451.0,702,824,687,1121,657,659,734,1001
서울,903,662.0,399,860.0,1038,995,770,332,699,1193,992,663
세종,757,735.0,1085,860.0,663,662,992,1057,1107,660,731,727

In [159]:
# nan이 위에있는 놈으로 바뀐다

In [160]:
sales_pivot.fillna(method='ffill',axis=1)

,month_01,month_02,month_03,month_04,month_05,month_06,month_07,month_08,month_09,month_10,month_11,month_12
location,,,,,,,,,,,,
부산,818.0,662.0,954.0,451.0,702.0,824.0,687.0,1121.0,657.0,659.0,734.0,1001.0
서울,903.0,903.0,399.0,860.0,1038.0,995.0,770.0,332.0,699.0,1193.0,992.0,663.0
세종,757.0,735.0,1085.0,1085.0,663.0,662.0,992.0,1057.0,1107.0,660.0,731.0,727.0

In [161]:
#  nan이 왼쪽에있는걸로 바뀐다

In [162]:
sales_pivot.fillna(method='bfill',axis=1)

,month_01,month_02,month_03,month_04,month_05,month_06,month_07,month_08,month_09,month_10,month_11,month_12
location,,,,,,,,,,,,
부산,818.0,662.0,954.0,451.0,702.0,824.0,687.0,1121.0,657.0,659.0,734.0,1001.0
서울,903.0,399.0,399.0,860.0,1038.0,995.0,770.0,332.0,699.0,1193.0,992.0,663.0
세종,757.0,735.0,1085.0,663.0,663.0,662.0,992.0,1057.0,1107.0,660.0,731.0,727.0

In [163]:
# nan이 오른쪽에있는걸로 바뀐다.

In [164]:
day = np.datetime64('2023-01-01')

In [165]:
day = day + np.arange(365)

In [166]:
day_str = day.astype('str')

In [167]:
pd.Series(day_str).str.slice(5,7)
month = pd.Series(day_str).str[5:7]

In [168]:
sales_report = pd.DataFrame()
sales_report['day'] = day
sales_report['month'] = month
sales_report['location']=np.random.choice(['서울','부산','세종'],month.size)
sales_report['sales'] = np.random.randint(60,100,month.size)

In [169]:
sales_report

           day month location  sales
0   2023-01-01    01       부산     71
1   2023-01-02    01       서울     65
2   2023-01-03    01       세종     66
3   2023-01-04    01       부산     78
4   2023-01-05    01       부산     63
..         ...   ...      ...    ...
360 2023-12-27    12       서울     97
361 2023-12-28    12       부산     79
362 2023-12-29    12       부산     60
363 2023-12-30    12       서울     90
364 2023-12-31    12       세종     87

[365 rows x 4 columns]

In [170]:
sales_report.groupby(['month','location']).sum()

                sales
month location
01    부산          806
      서울          598
      세종          994
02    부산          672
      서울          763
      세종          890
03    부산          582
      서울         1065
      세종          879
04    부산          817
      서울          833
      세종          724
05    부산          815
      서울          761
      세종          794
06    부산          974
      서울          691
      세종          753
07    부산          787
      서울          877
      세종          867
08    부산          649
      서울         1274
      세종          543
09    부산          930
      서울          620
      세종          849
10    부산          933
      서울          660
      세종          899
11    부산          957
      서울          475
      세종          831
12    부산         1059
      서울          980
      세종          413

In [171]:
sales_report.groupby(['month','location']).mean()

                    sales
month location
01    부산        73.272727
      서울        74.750000
      세종        82.833333
02    부산        84.000000
      서울        84.777778
      세종        80.909091
03    부산        72.750000
      서울        88.750000
      세종        79.909091
04    부산        81.700000
      서울        75.727273
      세종        80.444444
05    부산        74.090909
      서울        76.100000
      세종        79.400000
06    부산        81.166667
      서울        76.777778
      세종        83.666667
07    부산        87.444444
      서울        79.727273
      세종        78.818182
08    부산        81.125000
      서울        79.625000
      세종        77.571429
09    부산        84.545455
      서울        77.500000
      세종        77.181818
10    부산        77.750000
      서울        82.500000
      세종        81.727273
11    부산        73.615385
      서울        79.166667
      세종        75.545455
12    부산        75.642857
      서울        81.666667
      세종        82.600000

In [172]:
sales_report.groupby(['month','location']).count().sales

month  location
01     부산          11
       서울           8
       세종          12
02     부산           8
       서울           9
       세종          11
03     부산           8
       서울          12
       세종          11
04     부산          10
       서울          11
       세종           9
05     부산          11
       서울          10
       세종          10
06     부산          12
       서울           9
       세종           9
07     부산           9
       서울          11
       세종          11
08     부산           8
       서울          16
       세종           7
09     부산          11
       서울           8
       세종          11
10     부산          12
       서울           8
       세종          11
11     부산          13
       서울           6
       세종          11
12     부산          14
       서울          12
       세종           5
Name: sales, dtype: int64

In [173]:
sales_df = sales_report.groupby(['month','location']).sum().reset_index()

In [174]:
sales_df

   month location  sales
0     01       부산    806
1     01       서울    598
2     01       세종    994
3     02       부산    672
4     02       서울    763
5     02       세종    890
6     03       부산    582
7     03       서울   1065
8     03       세종    879
9     04       부산    817
10    04       서울    833
11    04       세종    724
12    05       부산    815
13    05       서울    761
14    05       세종    794
15    06       부산    974
16    06       서울    691
17    06       세종    753
18    07       부산    787
19    07       서울    877
20    07       세종    867
21    08       부산    649
22    08       서울   1274
23    08       세종    543
24    09       부산    930
25    09       서울    620
26    09       세종    849
27    10       부산    933
28    10       서울    660
29    10       세종    899
30    11       부산    957
31    11       서울    475
32    11       세종    831
33    12       부산   1059
34    12       서울    980
35    12       세종    413

In [175]:
sales_df.pivot(index=['location'],columns=['month'],values=['sales'])

         sales
month       01   02    03   04   05   06   07    08   09   10   11    12
location
부산         806  672   582  817  815  974  787   649  930  933  957  1059
서울         598  763  1065  833  761  691  877  1274  620  660  475   980
세종         994  890   879  724  794  753  867   543  849  899  831   413

In [176]:
pd.date_range('2023-01-01',
              periods = 365,
              freq='D')

# freq='B' 일하는날 ! 휴일 x

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10',
               ...
               '2023-12-22', '2023-12-23', '2023-12-24', '2023-12-25',
               '2023-12-26', '2023-12-27', '2023-12-28', '2023-12-29',
               '2023-12-30', '2023-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [177]:
sales_total = pd.DataFrame()
sales_total['day'] = day
sales_total['location'] = np.random.choice(['서울','부산','세종'],day.size)
sales_total['sales'] = np.random.randint(60,100,day.size)

In [178]:
sales_total.day.dt.month

0       1
1       1
2       1
3       1
4       1
       ..
360    12
361    12
362    12
363    12
364    12
Name: day, Length: 365, dtype: int64

In [179]:
sales_total.groupby([sales_total.day.dt.month,'location']).sum()

              sales
day location
1   부산          792
    서울          563
    세종         1003
2   부산          762
    서울          529
    세종          997
3   부산          667
    서울          749
    세종         1152
4   부산          718
    서울          730
    세종          982
5   부산         1000
    서울          761
    세종          705
6   부산          921
    서울          431
    세종         1064
7   부산          890
    서울          737
    세종          908
8   부산         1140
    서울          713
    세종          618
9   부산          638
    서울          658
    세종         1157
10  부산         1155
    서울          676
    세종          534
11  부산          742
    서울         1080
    세종          521
12  부산          702
    서울          818
    세종          913

In [180]:
date = pd.date_range('2011-01-01',
             periods=365,
             freq='D')

In [181]:
date

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05', '2011-01-06', '2011-01-07', '2011-01-08',
               '2011-01-09', '2011-01-10',
               ...
               '2011-12-22', '2011-12-23', '2011-12-24', '2011-12-25',
               '2011-12-26', '2011-12-27', '2011-12-28', '2011-12-29',
               '2011-12-30', '2011-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [182]:
date_str = date.astype('str')

In [183]:
'무서울게 없다 왜냐? 머리에 든게 없으니까'

'무서울게 없다 왜냐? 머리에 든게 없으니까'

In [184]:
date_str.str.slice(0,4)
date_str.str[:4]
date_str.str[5:7]
date_str.str[-2:]

Index(['01', '02', '03', '04', '05', '06', '07', '08', '09', '10',
       ...
       '22', '23', '24', '25', '26', '27', '28', '29', '30', '31'],
      dtype='object', length=365)

In [185]:
# 여기뭐가 비었음

In [186]:
sales_total.loc[sales_total.location,n('서울','세종'),:]
# 아니 시발 이게 파이썬 수업이야 타자경진대회연습이야 진짜

NameError: name 'n' is not defined

In [187]:
df1 = pd.DataFrame(np.ones((4,3)))
df2 = pd.DataFrame(np.ones((3,4)))

In [188]:
df1.columns = ['a','b','c']
df2.columns = ['a','b','c','d']

In [189]:
df1.index = [0,1,2,3] 
df2.index = [2,3,4]

In [190]:
print(df1)

     a    b    c
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0

In [191]:
print(df2)

     a    b    c    d
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

In [192]:
pd.concat([df1,df2])

     a    b    c    d
0  1.0  1.0  1.0  NaN
1  1.0  1.0  1.0  NaN
2  1.0  1.0  1.0  NaN
3  1.0  1.0  1.0  NaN
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

In [193]:
pd.concat(([df1,df2]),axis=1)

     a    b    c    a    b    c    d
0  1.0  1.0  1.0  NaN  NaN  NaN  NaN
1  1.0  1.0  1.0  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0  1.0  1.0  1.0
4  NaN  NaN  NaN  1.0  1.0  1.0  1.0

In [194]:
pd.concat([df1,df2],ignore_index=True)

     a    b    c    d
0  1.0  1.0  1.0  NaN
1  1.0  1.0  1.0  NaN
2  1.0  1.0  1.0  NaN
3  1.0  1.0  1.0  NaN
4  1.0  1.0  1.0  1.0
5  1.0  1.0  1.0  1.0
6  1.0  1.0  1.0  1.0

In [195]:
pd.concat([df1,df2],axis=1,ignore_index=True)

     0    1    2    3    4    5    6
0  1.0  1.0  1.0  NaN  NaN  NaN  NaN
1  1.0  1.0  1.0  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0  1.0  1.0  1.0
4  NaN  NaN  NaN  1.0  1.0  1.0  1.0

In [196]:
pd.concat([df1,df2],axis=1,join='inner')

     a    b    c    a    b    c    d
2  1.0  1.0  1.0  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0  1.0  1.0  1.0

In [197]:
titanic_left = titanic.iloc[:,5]
titanic_right = titanic.iloc[:,5]

In [200]:
pd.merge(titanic_left,titanic_right,how='inner').columns

Index(['parch'], dtype='object')

In [203]:
titanic_left.rename(columns={'index':'왼쪽순서'},inplace=True)
titanic_right.rename(columns={'index':'오른쪽순서'},inplace=True)

TypeError: rename() got an unexpected keyword argument 'columns'

In [236]:
df = pd.DataFrame()

In [237]:

df['key1'] = [1,2,3,1,2,3]
df['key2'] = [4,5,6,7,7,7]
df['val'] = [11,12,13,14,15,16]

In [238]:
df2 = pd.DataFrame()
df['key1'] = [1,2,3,1,2,3]
df['key2'] = [4,5,6,7,7,7]
df['val'] = [15,16,17,18,19,20]

In [228]:
pd.merge(df, df2, how='inner', right_on=['key1', 'key2'], left_on=['key1', 'key2'])

KeyError: 'key1'

In [250]:
df = titanic[['survived','pclass','fare']]

In [252]:
for i in np.unique(df.survived):
    print(i,np.mean(df.loc[df.survived == i,:].fare))

0 22.117886885245877
1 48.39540760233917

In [253]:
df.groupby('survived').mean().fare

survived
0    22.117887
1    48.395408
Name: fare, dtype: float64

In [6]:
# for i in np.unique(df.survived):
#     for j in np.unique(df.pclass):
#         np.mean(i,j,np.mean(df.loc[(df.survived == i) & (df.pclass==j),:].fare))
for i in np.unique(df.survived):
    for j in np.unique(df.pclass):
        print(i,j,np.mean(df.loc[(df.survived==i) & (df.pclass==j),:].fare))

0 1 64.68400750000002
0 2 19.412327835051546
0 3 13.66936424731183
1 1 95.60802867647055
1 2 22.0557
1 3 13.694887394957966